HomeWork-3/reports/withIndex/R1-d5m/wrk2.txt
Running 5m test @ http://localhost:5000
  1 threads and 1 connections
  Thread calibration: mean lat.: 524.915ms, rate sampling interval: 1064ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   532.56ms   13.85ms 567.81ms   72.76%
    Req/Sec     0.06      0.24     1.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  530.94ms
 75.000%  544.77ms
 90.000%  548.35ms
 99.000%  565.76ms
 99.900%  568.32ms
 99.990%  568.32ms
 99.999%  568.32ms
100.000%  568.32ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     492.287     0.000000            1         1.00
     517.119     0.100000           29         1.11
     521.215     0.200000           63         1.25
     523.519     0.300000           88         1.43
     525.823     0.400000          119         1.67
     530.943     0.500000          148         2.00
     538.111     0.550000          162         2.22
     541.183     0.600000          175         2.50
     542.719     0.650000          189         2.86
     543.743     0.700000          205         3.33
     544.767     0.750000          222         4.00
     545.279     0.775000          230         4.44
     545.791     0.800000          235         5.00
     546.303     0.825000          241         5.71
     546.815     0.850000          249         6.67
     547.327     0.875000          258         8.00
     547.327     0.887500          258         8.89
     548.351     0.900000          266        10.00
     548.351     0.912500          266        11.43
     548.863     0.925000          271        13.33
     549.375     0.937500          272        16.00
     549.887     0.943750          275        17.78
     550.911     0.950000          278        20.00
     550.911     0.956250          278        22.86
     551.935     0.962500          281        26.67
     551.935     0.968750          281        32.00
     552.959     0.971875          282        35.56
     553.983     0.975000          283        40.00
     555.519     0.978125          284        45.71
     556.543     0.981250          285        53.33
     562.687     0.984375          286        64.00
     562.687     0.985938          286        71.11
     565.759     0.987500          287        80.00
     565.759     0.989062          287        91.43
     566.783     0.990625          288       106.67
     566.783     0.992188          288       128.00
     566.783     0.992969          288       142.22
     568.319     0.993750          290       160.00
     568.319     1.000000          290          inf
#[Mean    =      532.560, StdDeviation   =       13.855]
#[Max     =      567.808, Total count    =          290]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  529.41ms
 75.000%  543.74ms
 90.000%  546.82ms
 99.000%  564.22ms
 99.900%  567.29ms
 99.990%  567.29ms
 99.999%  567.29ms
100.000%  567.29ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     491.519     0.000000            1         1.00
     516.351     0.100000           30         1.11
     519.935     0.200000           59         1.25
     522.495     0.300000           88         1.43
     524.799     0.400000          117         1.67
     529.407     0.500000          145         2.00
     537.087     0.550000          161         2.22
     540.159     0.600000          177         2.50
     541.695     0.650000          191         2.86
     542.719     0.700000          205         3.33
     543.743     0.750000          221         4.00
     544.255     0.775000          231         4.44
     544.767     0.800000          237         5.00
     545.279     0.825000          241         5.71
     545.791     0.850000          248         6.67
     546.303     0.875000          257         8.00
     546.815     0.887500          263         8.89
     546.815     0.900000          263        10.00
     547.327     0.912500          265        11.43
     547.839     0.925000          271        13.33
     548.351     0.937500          272        16.00
     549.375     0.943750          274        17.78
     549.887     0.950000          277        20.00
     550.399     0.956250          279        22.86
     550.911     0.962500          281        26.67
     550.911     0.968750          281        32.00
     551.935     0.971875          282        35.56
     552.959     0.975000          283        40.00
     555.007     0.978125          285        45.71
     555.007     0.981250          285        53.33
     561.151     0.984375          286        64.00
     561.151     0.985938          286        71.11
     564.223     0.987500          287        80.00
     564.223     0.989062          287        91.43
     565.247     0.990625          288       106.67
     565.247     0.992188          288       128.00
     565.247     0.992969          288       142.22
     566.783     0.993750          289       160.00
     566.783     0.994531          289       182.86
     566.783     0.995313          289       213.33
     566.783     0.996094          289       256.00
     566.783     0.996484          289       284.44
     567.295     0.996875          290       320.00
     567.295     1.000000          290          inf
#[Mean    =      531.517, StdDeviation   =       13.835]
#[Max     =      566.784, Total count    =          290]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  300 requests in 5.00m, 231.41KB read
Requests/sec:      1.00
Transfer/sec:     789.85B